<a href="https://colab.research.google.com/github/PaletteofDesign/groupby-exercises/blob/main/groupby_exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [4]:
url = 'https://raw.githubusercontent.com/mGalarnyk/Tutorial_Data/master/Pandas/CalIt2.data'
df = pd.read_csv(url, header=None)
df.head()

   0         1         2  3
0  7  07/24/05  00:00:00  0
1  9  07/24/05  00:00:00  0
2  7  07/24/05  00:30:00  1
3  9  07/24/05  00:30:00  0
4  7  07/24/05  01:00:00  0

In [9]:
df.rename(columns={0:'Flow_ID', 1:'Date', 2:'Time', 3:'Count'}, inplace=True)
df.head()

   Flow_ID      Date      Time  Count
0        7  07/24/05  00:00:00      0
1        9  07/24/05  00:00:00      0
2        7  07/24/05  00:30:00      1
3        9  07/24/05  00:30:00      0
4        7  07/24/05  01:00:00      0

In [26]:
d_filter = (df['Date']=='07/24/05') & (df['Flow_ID']==7)
df[d_filter].head()

   Flow_ID      Date      Time  Count
0        7  07/24/05  00:00:00      0
2        7  07/24/05  00:30:00      1
4        7  07/24/05  01:00:00      0
6        7  07/24/05  01:30:00      0
8        7  07/24/05  02:00:00      0

In [27]:
len(df)

10080

In [29]:
len(df[d_filter])

48

In [40]:
top_10 = df.loc[d_filter, :].sort_values(by=['Count'], ascending=False).head(10)
top_10

    Flow_ID      Date      Time  Count
72        7  07/24/05  18:00:00      4
84        7  07/24/05  21:00:00      3
76        7  07/24/05  19:00:00      2
92        7  07/24/05  23:00:00      2
30        7  07/24/05  07:30:00      2
10        7  07/24/05  02:30:00      2
86        7  07/24/05  21:30:00      2
70        7  07/24/05  17:30:00      2
68        7  07/24/05  17:00:00      1
74        7  07/24/05  18:30:00      1

In [39]:
min_val = top_10['Count'].min()
min_val

1

In [41]:
top_10['Count'].apply(lambda x: x - min_val)

72    3
84    2
76    1
92    1
30    1
10    1
86    1
70    1
68    0
74    0
Name: Count, dtype: int64

In [42]:
top_10['Count'].apply(lambda x: x - min_val).mean()

1.1

In [43]:
d_filter = (df['Flow_ID']==7) & (df['Date'].str.startswith('08') & df['Date'].str.endswith('05'))

In [44]:
df.loc[d_filter,:].groupby('Date').max()

          Flow_ID      Time  Count
Date
08/01/05        7  23:30:00     18
08/02/05        7  23:30:00     16
08/03/05        7  23:30:00     26
08/04/05        7  23:30:00     40
08/05/05        7  23:30:00     17
08/06/05        7  23:30:00      8
08/07/05        7  23:30:00      3
08/08/05        7  23:30:00     16
08/09/05        7  23:30:00     19
08/10/05        7  23:30:00     25
08/11/05        7  23:30:00     16
08/12/05        7  23:30:00     21
08/13/05        7  23:30:00      5
08/14/05        7  23:30:00      3
08/15/05        7  23:30:00     17
08/16/05        7  23:30:00     24
08/17/05        7  23:30:00     22
08/18/05        7  23:30:00     39
08/19/05        7  23:30:00     23
08/20/05        7  23:30:00      3
08/21/05        7  23:30:00      4
08/22/05        7  23:30:00     23
08/23/05        7  23:30:00     25
08/24/05        7  23:30:00     17
08/25/05        7  23:30:00     24
08/26/05        7  23:30:00     22
08/27/05        7  23:30:00      3
08/28/05        7  23:30:00      7
08/29/05        7  23:30:00     15
08/30/05        7  23:30:00     47
08/31/05        7  23:30:00     19